import {
  type IBenefitsItem,
  type IOrderStep,
  type IServiceItem,
  type ISlide,
  type IPartnershipBenefits,
  type IWorkflow,
  type IRequirements,
  type IAccession,
  type IAboutUs,
  type IQuestions,
  type IHeroGrid,
  type ILegalInfoArticle,
  type IStatisticItem,
  BenefitLabel,
  IconName,
  QuestionAnswer,
  QuestionTitle,
  WorkType,
  StatisticCount,
  StatisticLabel,
  CompanyContacts,
  Requisites,
} from '../types';
import { imageSettings } from './imageSettings';

export const getBenefits = (): IBenefitsItem[] => {
  return [
    {
      id: 'uniqueness-item',
      iconName: IconName.Benefits1,
      label: BenefitLabel.Uniqueness,
    },
    {
      id: 'guarantee-item',
      iconName: IconName.Benefits2,
      label: BenefitLabel.Guarantee,
    },
    {
      id: 'corrections-item',
      iconName: IconName.Benefits3,
      label: BenefitLabel.Correction,
    },
    {
      id: 'support-item',
      iconName: IconName.Benefits4,
      label: BenefitLabel.Support,
    },
  ];
};

export const getFeedbackSlides = (): ISlide[] => {
  const {
    slideMemberFirst,
    slideMemberSecond,
    slideMemberThird,
    slideMemberFourth,
    slideMemberFifth,
    slideMemberSixth,
    slideMemberSeventh,
  } = imageSettings;
  return [
    {
      id: '1',
      title: 'Анна Парфенюк',
      description:
        'Замовляла магістерську роботу по програмній інженерії. Дуже задоволена сервісом. Все зроблено на найвищому рівні',
      imageSrc: slideMemberFirst.src,
      imageAlt: slideMemberFirst.alt,
      memberRating: 5,
    },
    {
      id: '2',
      title: 'Владислав Бурківський',
      description: 'Замовляв курсову роботу по кібербезпеці, все зроблено вчасно і якісно ',
      imageSrc: slideMemberSecond.src,
      imageAlt: slideMemberSecond.alt,
      memberRating: 4,
    },
    {
      id: '3',
      title: 'Вадим Зосименко',
      description: 'Потрібна була курсова за короткий термін. Впоралися чудово! Дякую!',
      imageSrc: slideMemberThird.src,
      imageAlt: slideMemberThird.alt,
      memberRating: 5,
    },
    {
      id: '4',
      title: 'Ірина Сидорчук',
      description:
        'Замовляла магістерську роботу по психології на цьому сайті, і результат перевершив всі мої очікування! Виконавці дійсно професіонали своєї справи: робота була виконана вчасно, з урахуванням усіх моїх побажань і вимог. Рекомендую на всі 100',
      imageSrc: slideMemberFourth.src,
      imageAlt: slideMemberFourth.alt,
      memberRating: 5,
    },
    {
      id: '5',
      title: 'Володимир Шелест',
      description:
        'Дуже задоволений сервісом цього сайту! Замовляв курсову роботу з досить складною темою по філології, і команда виконавців впоралась чудово. Рекомендую всім, хто шукає якісні послуги з написання навчальних робіт',
      imageSrc: slideMemberFifth.src,
      imageAlt: slideMemberFifth.alt,
      memberRating: 5,
    },
    {
      id: '6',
      title: 'Кароліна Зубрицька',
      description: 'Сервіс просто супер! Задоволена на всі 100%',
      imageSrc: slideMemberSixth.src,
      imageAlt: slideMemberSixth.alt,
      memberRating: 5,
    },
    {
      id: '7',
      title: 'Володимир Шкварницький',
      description:
        'Дипломна робота по галузевому машинобудуванні написана бездоганно. Дуже задоволений результатом',
      imageSrc: slideMemberSeventh.src,
      imageAlt: slideMemberSeventh.alt,
      memberRating: 5,
    },
  ];
};

export const getOrderSteps = (): IOrderStep[] => {
  return [
    {
      id: 'communication',
      step: 'Зв’яжіться з нами',
      iconName: IconName.Overview1,
    },
    {
      id: 'application process',
      step: 'Оформіть заявку',
      iconName: IconName.Overview2,
    },
    {
      id: 'prepayment',
      step: 'Після внесення 50% передоплати виконавець приступає до виконання завдання',
      iconName: IconName.Overview3,
    },
    {
      id: 'deal closing',
      step: 'По готовності сплачуєте решту суми і отримуєте готову роботу',
      iconName: IconName.Overview4,
    },
    {
      id: 'feedback',
      step: 'Залишаєте відгук',
      iconName: IconName.Overview5,
    },
  ];
};

export const getServices = (): IServiceItem[] => {
  const {
    serviceFirstItem,
    serviceSecondItem,
    serviceThirdItem,
    serviceFourthItem,
    serviceFifthItem,
    serviceSixthItem,
    serviceSeventhItem,
    serviceEighthItem,
    serviceNinthItem,
  } = imageSettings;
  return [
    {
      id: 'diplomas',
      imageSrc: serviceFirstItem.src,
      imageAlt: serviceFirstItem.alt,
      serviceTitle: WorkType.Diplomas,
    },
    {
      id: 'bachelorTheses',
      imageSrc: serviceSecondItem.src,
      imageAlt: serviceSecondItem.alt,
      serviceTitle: WorkType.BachelorTheses,
    },
    {
      id: 'masterTheses',
      imageSrc: serviceThirdItem.src,
      imageAlt: serviceThirdItem.alt,
      serviceTitle: WorkType.MasterTheses,
    },
    {
      id: 'teamPapers',
      imageSrc: serviceFourthItem.src,
      imageAlt: serviceFourthItem.alt,
      serviceTitle: WorkType.TeamPapers,
    },
    {
      id: 'testPapers',
      imageSrc: serviceFifthItem.src,
      imageAlt: serviceFifthItem.alt,
      serviceTitle: WorkType.TestPapers,
    },
    {
      id: 'practicalWorks',
      imageSrc: serviceSixthItem.src,
      imageAlt: serviceSixthItem.alt,
      serviceTitle: WorkType.PracticalWorks,
    },
    {
      id: 'abstracts',
      imageSrc: serviceSeventhItem.src,
      imageAlt: serviceSeventhItem.alt,
      serviceTitle: WorkType.Abstracts,
    },
    {
      id: 'caseStudyReports',
      imageSrc: serviceEighthItem.src,
      imageAlt: serviceEighthItem.alt,
      serviceTitle: WorkType.CaseStudyReports,
    },
    {
      id: 'presentations',
      imageSrc: serviceNinthItem.src,
      imageAlt: serviceNinthItem.alt,
      serviceTitle: WorkType.Presentations,
    },
  ];
};

export const getAboutUsData = (): IAboutUs[] => {
  const { partnershipAboutUs1, partnershipAboutUs2 } = imageSettings;
  return [
    {
      id: '1',
      title: 'Хто ми?',
      description:
        'Ми - платформа, що спеціалізується на виконанні наукових робіт на замовлення. Наша мета - надавати якісні та професійні послуги нашим клієнтам, допомагаючи їм досягти успіху в їхніх навчальних цілях',
      imageSrc: partnershipAboutUs1.src,
      imageAlt: partnershipAboutUs1.alt,
    },
    {
      id: '2',
      title: 'Кого ми шукаємо?',
      description:
        'Ми запрошуємо талановитих та відповідальних виконавців, готових долучитися до нашої команди. Якщо ви експерт у вашій галузі, володієте високим рівнем професіоналізму та бажаєте працювати в команді, це місце для вас',
      imageSrc: partnershipAboutUs2.src,
      imageAlt: partnershipAboutUs2.alt,
    },
  ];
};

export const getPartnershipBenefits = (): IPartnershipBenefits[] => {
  return [
    {
      id: '1',
      title: 'Конкурентна винагорода',
      description: 'Ми пропонуємо справедливу оплату за виконану роботу',
      iconName: IconName.BenefitPartnership1,
    },
    {
      id: '2',
      title: 'Гнучкий графік',
      description: 'Обирайте час роботи, який буде для вас найзручнішим',
      iconName: IconName.BenefitPartnership2,
    },
    {
      id: '3',
      title: 'Ваш розвиток',
      description: 'Розвивайтеся та вдосконалюйте навички з проектами',
      iconName: IconName.BenefitPartnership3,
    },
  ];
};

export const getWorkflowData = (): IWorkflow[] => {
  return [
    {
      id: '1',
      title: 'Реєстрація',
      description:
        'Заходьте до нашої платформи в Telegram-бот і заповніть форму з вказанням вашого досвіду та спеціалізації',
      gridMarkup: 'lg:row-start-1 lg:row-end-3',
    },
    {
      id: '2',
      title: 'Отримання завдань',
      description:
        'Якщо замовлення відповідає вашій експертизі, наш менеджер зв’яжеться з вами для узгодження деталей',
      gridMarkup: 'lg:row-start-2 lg:row-end-4 lg:col-start-2',
    },
    {
      id: '3',
      title: 'Виконання замовлення',
      description:
        'Після прийняття замовлення виконуйте його з відповідальністю та уважністю до деталей',
      gridMarkup: 'lg:row-start-3 lg:row-end-5',
    },
    {
      id: '4',
      title: 'Отримання оплати',
      description:
        'Після успішного виконання замовлення оплата буде здійснена відповідно до обговорених умов',
      gridMarkup: 'lg:row-start-4 lg:row-end-6 lg:col-start-2',
    },
    {
      id: '5',
      title: 'Комунікація та підтримка',
      description:
        'Забезпечуйте відкриту комунікацію з клієнтами та готовність вносити зміни за потреби',
      gridMarkup: 'lg:row-start-5 lg:row-end-7',
    },
  ];
};

export const getRequirements = (): IRequirements[] => {
  return [
    {
      id: '1',
      title: 'Якість та терміни',
      description:
        'Ми надаємо високоякісні послуги. Виконавці повинні працювати вчасно та відповідально',
    },
    {
      id: '2',
      title: 'Фаховість',
      description:
        'Шукаємо фахівців з високим рівнем знань та досвідом. Вища освіта або значний досвід роботи – перевага',
    },
    {
      id: '3',
      title: 'Навички співпраці',
      description:
        'Командна робота та врахування потреб клієнтів – це ключовий аспект успішної співпраці',
    },
  ];
};

export const getAccession = (): IAccession[] => {
  return [
    {
      id: '1',
      desc: 'Відправте інформацію про ваш досвід та спеціалізацію нашому менеджеру через наш Telegram-бот',
    },
    {
      id: '2',
      desc: 'Наш менеджер зв’яжеться з вами для узгодження подальших інструкцій та деталей',
    },
    {
      id: '3',
      desc: 'Станьте частиною команди виконавців та допоможіть нашим клієнтам досягти цілей разом з нами',
    },
  ];
};

export const getFAQQuestions = (): IQuestions[] => {
  return [
    {
      id: 'Question 1',
      title: QuestionTitle.Issue1,
      answer: QuestionAnswer.Answer1,
    },
    {
      id: 'Question 2',
      title: QuestionTitle.Issue2,
      answer: QuestionAnswer.Answer2,
    },
    {
      id: 'Question 3',
      title: QuestionTitle.Issue3,
      answer: QuestionAnswer.Answer3,
    },
    {
      id: 'Question 4',
      title: QuestionTitle.Issue4,
      answer: QuestionAnswer.Answer4,
    },
    {
      id: 'Question 5',
      title: QuestionTitle.Issue5,
      answer: QuestionAnswer.Answer5,
    },
    {
      id: 'Question 6',
      title: QuestionTitle.Issue6,
      answer: QuestionAnswer.Answer6,
    },
    {
      id: 'Question 7',
      title: QuestionTitle.Issue7,
      answer: QuestionAnswer.Answer7,
    },
    {
      id: 'Question 8',
      title: QuestionTitle.Issue8,
      answer: QuestionAnswer.Answer8,
    },
    {
      id: 'Question 9',
      title: QuestionTitle.Issue9,
      answer: QuestionAnswer.Answer9,
    },
    {
      id: 'Question 10',
      title: QuestionTitle.Issue10,
      answer: QuestionAnswer.Answer10,
    },
  ];
};

export const getHeroGrid = (): IHeroGrid[] => {
  const { heroMatrixTop, heroMatrixMiddle, heroMatrixBottom } = imageSettings;
  return [
    {
      id: 'top-left',
      className:
        'overflow-hidden rounded-bl-[30px] rounded-tr-[30px] bg-whiteBase/20 lg:rounded-bl-[60px] lg:rounded-tr-[60px]',
      imageSrc: heroMatrixTop.src,
      imageAlt: heroMatrixTop.alt,
    },
    {
      id: 'top-right',
      className: 'col-start-3 rounded-t-[30px] bg-accentPrimary-darker/20 lg:rounded-t-[60px]',
    },
    {
      id: 'middle-left',
      className: 'row-start-2 rounded-ss-[50px] bg-accentPrimary/20 lg:rounded-ss-[100px]',
    },
    {
      id: 'middle-center',
      className: 'bg-whiteBase/20',
      imageSrc: heroMatrixMiddle.src,
      imageAlt: heroMatrixMiddle.alt,
    },
    {
      id: 'middle-right',
      className: 'rounded-ee-[50px] bg-accentSecondary/20 lg:rounded-ee-[100px]',
    },
    {
      id: 'bottom-left',
      className:
        'rounded-b-[30px] bg-disabled-background/10 dark:bg-whiteBase/20 lg:rounded-b-[60px]',
    },
    {
      id: 'bottom-right',
      className:
        'col-start-3 overflow-hidden rounded-bl-[30px] rounded-tr-[30px] bg-whiteBase/20  lg:rounded-bl-[60px] lg:rounded-tr-[60px]',
      imageSrc: heroMatrixBottom.src,
      imageAlt: heroMatrixBottom.alt,
    },
  ];
};

export const getPolicyArticles = (): ILegalInfoArticle[] => {
  return [
    {
      id: 1,
      article: 'Загальні положення',
      paragraph: {
        one: {
          title: 'Визначення термінів',
          subItems: [
            {
              id: 'first-article-01',
              textField:
                'Персональні дані ‒ відомості чи сукупність відомостей про фізичну особу, яка ідентифікована або може бути конкретно ідентифікована.',
            },
            {
              id: 'first-article-02',
              textField:
                'Обробка персональних даних ‒ будь-яка дія або сукупність дій, які здійснюються з персональними даними з використанням автоматизованих засобів або без використання таких засобів, включаючи збирання, запис, накопичення, зберігання, адаптування, зміна, поновлення, використання та розповсюдження (поширення, реалізація, передача), знеособлення, знищення персональних даних.',
            },
            {
              id: 'first-article-03',
              textField:
                'Користувач ‒ будь-яка особа, яка відвідує веб-сайт та/або використовує його можливості.',
            },
          ],
        },
        two: 'Користувачі веб-сайту можуть переглядати сторінки сайту без необхідності надавати будь-які Персональні дані. Однак для надання послуг, пов’язаних з купівлею товарів, які представлені на нашому веб-сайті, нам потрібні ваші контактні дані, щоб ми могли зв’язатися з вами, підтвердити замовлення і доставити замовлений товар. Ваші персональні дані ми не передаємо третім особам і захищаємо їх конфіденційність.',
        three:
          'Конфіденційність персональних даних – це обовʼязкова умова, яку ми дотримуємося для забезпечення безпеки та захисту інформації наших користувачів.',
        four: 'Використання Користувачем веб-сайту означає згоду з цією Політикою та умовами Обробки персональних даних Користувача.',
        five: 'У випадку незгоди з умовами Політики, Користувач повинен припинити використання веб-сайту.',
        six: 'Ця Політика застосовується тільки до сайту your-website.com. Ми не несемо відповідальності за сайти третіх осіб, на які Користувач може перейти за посиланнями, доступними на нашому веб-сайті.', //FIXME: add real site address
        seven:
          'Адміністрація веб-сайту не перевіряє правдивість персональних даних, що надаються Користувачем веб-сайту.',
      },
    },
    {
      id: 2,
      article: 'Персональні дані',
      paragraph: {
        one: {
          title: 'Збір персональних даних',
          subItems: [
            {
              id: 'second-article-01',
              textField:
                'Персональні дані Користувача ми отримуємо від Користувача при оформленні замовлення за телефонами, які вказані на сайті, через Telegram-бот, або при написанні на електронну пошту.',
            },
            {
              id: 'second-article-02',
              textField:
                'Обов’язкова для надання послуги інформація позначена спеціальним чином. Інша інформація надається Користувачем на його розсуд.',
            },
            {
              id: 'second-article-03',
              textField:
                'Веб-сайт не збирає і не зберігає персональні дані користувачів. Персональні дані користувачів, такі як ім’я, прізвище, контактний телефон, адреса електронної пошти тощо, отримані в Telegram, використовуються виключно для виконання замовлення і не зберігаються на веб-сайті.',
            },
            {
              id: 'second-article-04',
              textField: 'Веб-сайт не збирає IP-адреси користувачів.',
            },
          ],
        },
        two: {
          title: 'Використання персональних даних',
          subItems: [
            {
              id: 'second-article-05',
              textField:
                'Дані, такі як імʼя та прізвище, збираються і використовуються виключно для публікації відгуків користувачів на нашому веб-сайті.',
            },
            {
              id: 'second-article-06',
              textField:
                'Інформація, введена Користувачем у Telegram-боті, використовується для зв’язку з користувачем і передачі замовлення менеджеру. Дані користувачів використовуються виключно для виконання замовлення.',
            },
          ],
        },
        three: {
          title: 'Передача персональних даних третім особам',
          subItems: [
            {
              id: 'second-article-07',
              textField:
                'Ми не передаємо персональні дані Користувача третім особам крім випадків визначених законодавством України.',
            },
            {
              id: 'second-article-08',
              textField:
                'Передача інформації про Користувача третім особам можлива виключно з метою виконання замовлення Користувача. Зокрема, Користувач погоджується з тим, що менеджер веб-сайту має право передавати персональні дані кур’єрським службам, організаціям поштового зв’язку, операторам зв’язку, виключно з метою виконання замовлення Користувача, включаючи доставку Товару.',
            },
          ],
        },
        four: {
          title: 'Захист персональних даних',
          subItems: [
            {
              id: 'second-article-09',
              textField:
                'У разі втрати або розголошення персональних даних, ми інформуємо Користувача про втрату або розголошення таких даних.',
            },
            {
              id: 'second-article-10',
              textField:
                'Ми приймаємо необхідні організаційні та технічні заходи для захисту інформації користувача від неправомірного або випадкового доступу, знищення, перекручення, блокування, копіювання, поширення, а також від інших неправомірних дій третіх осіб.',
            },
          ],
        },
        fifth: {
          title: 'Зміна персональних даних',
          subItems: [
            {
              id: 'second-article-11',
              textField:
                'Користувач може змінити або видалити надану ним персональну інформацію, звернувшись до нашого менеджера за допомогою контактних даних, зазначених на сайті або в Telegram-боті.',
            },
          ],
        },
      },
    },
    {
      id: 3,
      article: 'Зміна Політики конфіденційності',
      paragraph: {
        one: 'Ми маємо право змінити умови Політики. У такому випадку ми оновимо версію документа на сторінці «Політика конфіденційності». Будь ласка, періодично переглядайте ці умови, щоб бути поінформованими про те, як ми захищаємо інформацію наших користувачів.',
      },
    },
    {
      id: 4,
      article: 'Зворотний зв’язок. Питання та пропозиції',
      paragraph: {
        one: `Всі пропозиції або питання щодо цієї Політики слід повідомляти до нашої служби підтримки користувачів за електронною поштою ${CompanyContacts.Email}.`,
      },
    },
  ];
};

export const getOfferArticles = (): ILegalInfoArticle[] => {
  return [
    {
      id: 1,
      article: 'Загальні положення',
      paragraph: {
        one: 'Цей Договір є офіційною та публічною пропозицією Продавця на укладання Договору купівлі-продажу Товару, представленого на сайті AcademicAtlas.com.ua (далі – «веб-сайт»).', //FIXME: add real site address
        two: 'Даний Договір є публічним, тобто відповідно до статті 633 Цивільного кодексу України, його умови є однаковими для всіх Покупців без надання переваги одному Покупцю перед іншим.',
        three:
          'Шляхом укладання цього Договору покупець в повному обсязі приймає умови та порядок оформлення замовлення, оплати Товару, доставки Товару, повернення Товару, відповідальності за недобросовісне замовлення та усі інші умови Договору.',
        four: 'Договір вважається укладеним з моменту внесення авансового платежу і отримання Покупцем від Продавця підтвердження замовлення в електронному вигляді.',
        five: 'Згідно зі статтею 642 Цивільного кодексу України, повним і беззастережним прийняттям умов даної пропозиції (Оферти), що підтверджує укладення Договору купівлі-продажу Товарів на запропонованих нижче умовах, є факт оформлення та підтвердження замовлення.',
        six: 'Оформленням замовлення Покупець підтверджує узгодження і безумовне прийняття ним умов цієї пропозиції (Оферти).',
        seven: {
          title:
            'Укладаючи Договір (тобто акцептуючи умови цієї пропозиції шляхом оформлення замовлення), покупець підтверджує наступне: ',
          subItems: [
            {
              id: 'first-article-01',
              textField:
                'Покупець цілком і повністю ознайомлений, і згоден з умовами цієї пропозиції (Оферти).',
            },
            {
              id: 'first-article-02',
              textField:
                'Він дає дозвіл на збір, обробку та передачу персональних даних на умовах, визначених нижче в застереженні щодо збору, обробки та передачі персональних даних.',
            },
            {
              id: 'first-article-03',
              textField:
                'Дозвіл на обробку персональних даних діє протягом усього терміну дії Договору, а також протягом необмеженого терміну після закінчення його дії.',
            },
            {
              id: 'first-article-04',
              textField:
                'Укладаючи Договір, покупець підтверджує, що він повідомлений про права, встановлені Законом України «Про захист персональних даних», про цілі збору даних, а також про те, що його персональні дані передаються Продавцю з метою можливості виконання умов цього Договору, можливості проведення взаєморозрахунків, а також для отримання рахунків, актів та інших документів.',
            },
            {
              id: 'first-article-05',
              textField:
                'Покупець погоджується з тим, що Продавець має право надавати доступ та передавати його персональні дані третім особам без будь-яких додаткових повідомлень Покупця, не змінюючи при цьому мету обробки персональних даних.',
            },
            {
              id: 'first-article-06',
              textField:
                'Обсяг прав Покупця, як суб’єкта персональних даних, відповідно до Закону України «Про захист персональних даних» йому відомий і зрозумілий.',
            },
          ],
        },
      },
    },
    {
      id: 2,
      article: 'Поняття і визначення',
      paragraph: {
        one: 'Публічна оферта (далі – «Оферта») – публічна пропозиція Продавця, адресована невизначеному колу осіб, укласти з Продавцем Договір купівлі-продажу Товару дистанційним способом (далі – «Договір») на умовах, що містяться в цій Оферті.',
        two: 'Товар або Послуга – об’єкт угоди сторін, який був обраний Покупцем та замовлений Покупцем у Продавця дистанційним способом.',
        three:
          'Продавець – веб-сайт за адресою https://AcademicAtlas.com.ua створений для укладення угоди на підставі ознайомлення Покупця із запропонованим Продавцем описом Товару за допомогою мережі Інтернет.', //FIXME: add real site address
        four: 'Покупець – дієздатна фізична особа, яка досягла 18 років, отримує інформацію від Продавця, розміщує Замовлення щодо купівлі Товару, що представлений на веб-сайті для цілей, що не повʼязані зі здійсненням підприємницької діяльності.',
        five: 'Замовлення – вибір окремих позицій з переліку Товарів, зазначених Покупцем при замовленні і проведенні оплати.',
      },
    },
    {
      id: 3,
      article: 'Предмет договору',
      paragraph: {
        one: 'Продавець надає Покупцю Послуги з пошуку джерел і матеріалів під точковий пошуковий запит, допомагає правильно структурувати і оформити цю інформацію (далі – «Послуги»).',
        two: 'Продавець не надає жодних освітніх послуг і не продає жодних документів.',
      },
    },
    {
      id: 4,
      article: 'Порядок оформлення замовлення',
      paragraph: {
        one: 'Покупець самостійно оформлює Замовлення електронною поштою, у месенджері Telegram або за номером телефону, вказаним в розділі контактів веб-сайту.',
        two: 'Продавець має право відмовитися від передання Замовлення Покупцеві у випадку, якщо відомості, вказані Покупцем під час оформлення Замовлення, є неповними або викликають підозру щодо їх дійсності.',
        three: {
          title:
            'При оформленні Замовлення на веб-сайті покупець зобов’язується надати наступну обов’язкову інформацію, необхідну Продавцю для виконання Замовлення: ',
          subItems: [
            { id: 'fourth-article-01', textField: 'прізвище, ім’я Покупця;' },
            { id: 'fourth-article-02', textField: 'номер телефону або Telegram-нік;' },
            { id: 'fourth-article-03', textField: 'вид Товару;' },
            { id: 'fourth-article-04', textField: 'тема проекту.' },
          ],
        },
        four: 'Якщо будь-якій із сторін Договору необхідна додаткова інформація, вона має право запросити її у іншої сторони.',
        five: 'У разі ненадання необхідної інформації Покупцем, Продавець не несе відповідальності за надання якісної Послуги Покупцеві при Замовленні Товару через веб-сайт та Покупці цього Товару.',
      },
    },
    {
      id: 5,
      article: 'Порядок оплати замовлення',
      paragraph: {
        one: 'Вартість Послуг визначається на основі тарифів, встановлених в компанії Продавця, і може бути змінена Продавцем в односторонньому порядку.',
        two: 'Оплата Послуги здійснюється шляхом внесення авансового платежу в розмірі 50% від вартості Послуги перед початком її виконання.',
        three:
          'Якщо вартість Послуги складає менше 2500 грн, оплата здійснюється у повному обсязі перед початком виконання Послуги.',
        four: 'Повернення авансового платежу можливе протягом 12 годин після його внесення за вирахуванням 300 грн сервісного збору.',
        five: 'Повернення авансового платежу відбувається протягом 48 годин з моменту надання клієнтом платіжних відомостей для повернення.',
        six: 'Повернення 30% від вартості Послуги можливе у разі неможливості виконати доопрацювання, яке у письмовому вигляді покупець отримав від викладача.',
        seven:
          'Замовник втрачає право на повернення авансового платежу після початку виконання Замовлення та готовності його хоча б на одну третину.',
        eight:
          'Відправка виконаного Замовлення здійснюється тільки після повної сплати його вартості, погодженої перед початком виконання.',
      },
    },
    {
      id: 6,
      article: 'Права та обовʼязки сторін',
      paragraph: {
        one: {
          title: 'Продавець має право:',
          subItems: [
            {
              id: 'sixth-article-01',
              textField:
                'В односторонньому порядку припинити надання Послуг за цим Договором у разі порушення Покупцем умов цього Договору;',
            },
            {
              id: 'sixth-article-02',
              textField:
                'Змінювати умови цього Договору, а також тарифи на Послуги, що надаються, в односторонньому порядку, розміщуючи їх на веб-сайті. Усі зміни набирають чинності з моменту їх публікації.',
            },
            {
              id: 'sixth-article-03',
              textField: 'Відповідати Покупцеві протягом 24 годин в робочий час.',
            },
          ],
        },
        two: {
          title: 'Продавець зобовʼязаний:',
          subItems: [
            {
              id: 'sixth-article-04',
              textField:
                'Передати Покупцеві Товар у відповідності до умов цієї Оферти та Замовлення Покупця.',
            },
            {
              id: 'sixth-article-05',
              textField:
                'Не розголошувати будь-яку приватну інформацію про Покупця і не надавати доступ до цієї інформації третім особам, за винятком випадків, передбачених законодавством та під час виконання Замовлення Покупця.',
            },
          ],
        },
        three: {
          title: 'Покупець зобовʼязаний:',
          subItems: [
            {
              id: 'sixth-article-06',
              textField: 'Своєчасно оплатити і отримати Замовлення на умовах цього Договору;',
            },
            {
              id: 'sixth-article-07',
              textField:
                'Ознайомитися зі змістом Договору, умовами Договору і цінами, запропонованими Продавцем на веб-сайті.',
            },
          ],
        },
        four: {
          title: 'Покупець має право:',
          subItems: [
            {
              id: 'sixth-article-09',
              textField:
                'На претензії щодо якості роботи, які приймаються лише, якщо є письмова рецензія від наукового керівника чи викладача, який цю роботу перевіряє.',
            },
            {
              id: 'sixth-article-10',
              textField: 'Відправити Замовлення на доопрацювання 2 рази;',
            },
            {
              id: 'sixth-article-11',
              textField: 'Вимагати від Продавця виконання умов цього Договору.',
            },
          ],
        },
      },
    },
    {
      id: 7,
      article: 'Відповідальність сторін',
      paragraph: {
        one: 'За невиконання або неналежне виконання умов цього Договору сторони несуть відповідальність згідно з чинним законодавством України.',
        two: {
          title: 'Продавець не несе відповідальності за:',
          subItems: [
            {
              id: 'seventh-article-01',
              textField:
                'Зміст і правдивість інформації, наданої Покупцем при оформленні Замовлення;',
            },
            {
              id: 'seventh-article-02',
              textField: 'Зміну завдання на стороні Покупця;',
            },
            {
              id: 'seventh-article-03',
              textField:
                'Затримку та перебої в наданні Послуг (обробки Замовлення та виконанні Послуг), які відбуваються з причин, що знаходяться поза сферою його контролю;',
            },
            {
              id: 'seventh-article-04',
              textField:
                'Протиправні незаконні дії, здійснені Покупцем за допомогою даного веб-сайту;',
            },
            {
              id: 'seventh-article-05',
              textField:
                'Передачу Покупцем своїх мережевих ідентифікаторіи (IP-, MAC-адрес) третім особам.',
            },
          ],
        },
        three:
          'Покупець, використовуючи наданий йому доступ до мережі Інтернет, самостійно несе відповідальність за шкоду, заподіяну його діями, особам або їх майну, юридичним особам, державі чи принципам моральності.',
        four: 'Покупець несе відповідальність за розповсюдження недостовірної інформації. Якщо Покупець відмовляється її спростувати та компенсувати матеріальну та/або моральну шкоду, Продавець має право на захист своїх прав та інтересів шляхом звернення до суду.',
        five: 'Сторони прикладають максимум зусиль для вирішення будь-яких розбіжностей виключно шляхом переговорів.',
      },
    },
    {
      id: 8,
      article: 'Застереження щодо збору, обробки та передачі персональних даних',
      paragraph: {
        one: 'Покупець надає Продавцю згоду на збір, обробку та передачу своїх персональних даних у межах і на умовах, визначених Законом України «Про захист персональних даних».',
      },
    },
    {
      id: 9,
      article: 'Умови конфіденційності',
      paragraph: {
        one: 'Умови конфіденційності визначені Політикою конфіденційності, що є невід’ємною частиною Договору та розміщені на сторінці Політики конфіденційності.',
      },
    },
    {
      id: 10,
      article: 'Форс-мажор',
      paragraph: {
        one: 'Сторони звільняються від відповідальності за часткове або повне невиконання зобов’язань за цим Договором, якщо це невиконання є наслідком обставин непереборної сили (форс-мажор), які виникли після укладення цього Договору і які сторони не могли передбачити або запобігти розумними заходами.',
        two: 'До обставин непереборної сили відносяться події, які сторони не можуть контролювати, включаючи, але не обмежуючись: повінь, пожежа, землетрус або інші стихійні біди, відключення електроенергії, страйки, оголошена або фактична війна і інші подібні події, які об’єктивно унеможливлюють виконання зобов’язань за Договором.',
        three:
          'Сторона, яка не може виконувати свої зобов’язання через обставини непереборної сили, зобов’язана негайно повідомити іншу сторону про початок і закінчення таких обставин.',
      },
    },
    {
      id: 11,
      article: 'Інші умови',
      paragraph: {
        one: 'Цей договір укладено на території України і діє відповідно до чинного законодавства України.',
        two: 'Усі спори, що виникають між Покупцем і Продавцем, вирішуються шляхом переговорів. У випадку недосягнення врегулювання спірного питання шляхом переговорів, Покупець та/або Продавець мають право звернутися за вирішенням спору до судових органів відповідно до чинного законодавства України.',
        three:
          'Продавець залишає за собою право в односторонньому порядку вносити зміни до цього договору за умови попередньої публікації його на сайті https://AcademicAtlas.com.ua. Крім того, зміни до Договору також можуть бути внесені за взаємною згодою Сторін в порядку, передбаченому чинним законодавством України.', //FIXME: add real site address
        four: 'Оплата Покупцем оформленого Замовлення означає повну згоду Покупця з умовами цього Договору.',
      },
    },
    {
      id: 12,
      article: 'Термін дії Договору',
      paragraph: {
        one: 'Цей Договір вважається укладеним з моменту одержання особою, яка направила пропозицію укласти такий Договір, відповіді про прийняття цієї пропозиції в порядку, визначеному частиною шостою ст. 11 Закону України «Про електрону комерцію».',
        two: 'До закінчення терміну дії цей Договір може бути розірваний за взаємною згодою сторін до моменту фактичного виконання Послуги, шляхом повернення грошових коштів у випадках, передбачених цим Договором.',
        three:
          'Сторони мають право розірвати цей Договір в односторонньому порядку у разі невиконання однією зі сторін умов цього Договору та у випадках, передбачених чинним законодавством України.',
      },
    },
    {
      id: 13,
      article: 'Реквізити Продавця',
      paragraph: {},
    },
  ];
};

export const getRequisites = (): Requisites[] => {
  return [
    { id: 'company-name', fieldName: 'Academic Atlas' },
    {
      id: 'address',
      fieldName: 'Адреса: вул. Трипільська 13а, Житомир, Україна',
    },
    {
      id: 'phone',
      fieldName: 'Телефон: +380 (63) 20-761-20',
    },
    {
      id: 'email',
      fieldName: 'Email: AcademicAtlas@ukr.net',
    },
  ];
};

export const getDesktopStatistics = (): IStatisticItem[] => {
  return [
    { id: '1', count: StatisticCount.Year, label: StatisticLabel.Year },
    {
      id: '2',
      count: StatisticCount.Expert,
      label: StatisticLabel.Expert,
      showOnLargeScreen: true,
    },
    { id: '3', count: StatisticCount.Service, label: StatisticLabel.Service },
    {
      id: '4',
      count: StatisticCount.Speciality,
      label: StatisticLabel.Speciality,
      showOnLargeScreen: true,
    },
    { id: '5', count: StatisticCount.Work, label: StatisticLabel.Work, hideOnSmallScreen: true },
  ];
};
