export enum WorkTitle {
  Diplomas = 'Diplomas',
  TeamPapers = 'Team papers',
  BachelorTheses = 'Bachelor theses',
  TestPapers = 'Test papers',
  Abstracts = 'Scientific abstracts',
  PracticalWorks = 'Practical works',
}

export enum QuestionTitle {
  Team1 = '1. Які терміни для написання курсової роботи чи проекту?',
  Team2 = '2. Як можна замовити курсову роботу у вас?',
  Team3 = '3. Якщо у мене відсутня методичка і план, чи ви зможете мені допомогти з цим?',
  Team4 = '4. Якщо у наукового керівника виникнуть зауваження до роботи, чи буде плата за доопрацювання?',
  Team5 = '5. Чи гарантуєте ви високий рівень унікальності для курсової роботи чи проекту?',
  Team6 = '6. Чи можете ви підібрати підприємство та забезпечити необхідними даними для мого проекту чи курсової роботи?',
}

export enum QuestionAnswer {
  Team1 = 'Ми зазвичай пишемо курсові роботи та проекти протягом 3-5 днів. Якщо вам необхідна надзвичайно швидка виконання роботи - від 1-го дня, це можливо, але потребує додаткового узгодження з нашим автором. Ми завжди ставимося до якості з особливою увагою.',
  Team2 = 'Замовити курсову роботу у нас дуже просто. Ви можете зв`язатися з нашим менеджером, написавши в Телеграм або за адресою електронної пошти, надати методичні рекомендації або вимоги до виконання. Після  обговорення всіх деталей та внесення попередньої оплати, ми розпочнемо виконання роботи.',
  Team3 = 'Звісно, ми можемо розробити план курсової роботи або проекту, який потрібно буде затвердити з вашим науковим керівником. Після цього наш автор може розпочати написання роботи.',
  Team4 = 'У нас велика кількіст ь безкоштовних доопрацювань до моменту захисту роботи. Незалежно від кількості правок, ми гарантуємо їх безоплатну виконаність в межах затвердженого плану та теми.',
  Team5 = 'Так, всі наші роботи проходять перевірку в системі виявлення плагіату. Ми гарантуємо високий рівень унікальності, який відповідає вимогам вашого вишу.',
  Team6 = 'Звісно, ми можемо допомогти вам підібрати підприємство і надати необхідні дані для проведення дослідження у вашому проекті чи курсовій роботі. У разі, якщо вам необхідно використовувати первинні документи, звітність або іншу інформацію з печатками та підписами, ми також можемо забезпечити ці матеріали. Наша команда готова здійснити всі необхідні дії для забезпечення успішного виконання вашого завдання, включаючи збір необхідних документів та інформації з обраних джерел.',
}
